public static class WeatherInformation
{
    public static void Start()
    {
        /*Задача: Анализ данных о погоде

        Напишите программу на C#, которая анализирует ежедневные данные о погоде за месяц. Данные о погоде представлены в виде массива,
         где каждый элемент содержит информацию о температуре (в градусах Цельсия) и количестве осадков (в миллиметрах) за день.

        Входные данные:

        Массив int[] temperatures с температурами за каждый день месяца.
        Массив int[] precipitation с количеством осадков за каждый день месяца.

        Требования к программе:

        Рассчитать среднюю месячную температуру.
        Определить самый холодный и самый теплый дни в месяце.
        Посчитать общее количество осадков за месяц.
        Найти количество дней с осадками выше среднего.
        Вывести индексы дней, когда была заморозка (температура ниже 0 градусов Цельсия) и осадки были выше, чем в предыдущий день.

        Выходные данные:

        Вывести на экран среднюю месячную температуру.
        Вывести индексы самого холодного и самого теплого дня.
        Вывести общее количество осадков за месяц.
        Вывести количество дней с осадками выше среднего.
        Вывести индексы дней с заморозками и увеличением осадков по сравнению с предыдущим днем.*/

        /*int[] temperatures
        int[] precipitation */



    }
}

